<?php

//=====================================================================
// 従業員一覧
//=====================================================================
try {
    /* ===================================================
     * 初期処理
     * ===================================================
     */

    /*--共通ファイル呼び出し-------------------------------------*/
    require_once($_SERVER['DOCUMENT_ROOT'] . '/common/php/com_start.php');

    /*--変数定義-------------------------------------------------*/

    // 初期化
    $err      = array();
    $_SESSION['notice']['error']   = array();
    $dispData = array();
    $tgtData  = array();
    $upData   = array();


    /* ===================================================
     * 入力情報取得
     * ===================================================
     */

    /*-- 検索用パラメータ ---------------------------------------*/

    // 検索配列
    $search = filter_input(INPUT_GET, 'search', FILTER_DEFAULT, FILTER_REQUIRE_ARRAY);
    $search = $search ? $search : array();

    // フリーワード
    $search['freeword']  = isset($search['freeword']) ? $search['freeword'] : null;


    /*-- 更新用パラメータ ---------------------------------------*/

    // 削除ボタン
    $btnDel = h(filter_input(INPUT_POST, 'btnDel'));

    /*-- その他パラメータ ---------------------------------------*/

    // ページャー
    $page = h(filter_input(INPUT_GET, 'page'));

    /* ===================================================
     * イベント前処理(更新用配列作成、入力チェックなど)
     * ===================================================
     */

    /* -- 更新用配列作成 ----------------------------------------*/

    if ($btnDel) {
        $upData['id']     = $btnDel;
        $upData['enable'] = '無効';
    }

    /* ===================================================
     * イベント本処理(データ登録)
     * ===================================================
     */

    if ($btnDel && $upData) {

        // データ更新
        $res = upsert($loginUser, 'mst_page', $upData);

        // ログテーブルに登録する
        setEntryLog($upData);

        // 画面遷移
        $nextPage = $server['scriptName'] . '?page=' . $page;
        header("Location:" . $nextPage);
        exit;
    }

    /* ===================================================
     * イベント後処理(描画用データ作成)
     * ===================================================
     */

    /* -- データ取得 --------------------------------------------*/

    // 特設ページ
    $where = array();
    $orderBy = 'id DESC';
    $temp = select('mst_page', '*', $where, $orderBy);


    /* -- データ変換 --------------------------------------------*/

    /*-- 特設ページ一覧 ------------------------------*/
    foreach ($temp as $val) {

        // KEY
        $tgtId = $val['id'];

        // フリーワード
        if ($search['freeword']) {
            $word = $val['name'];
            if (strpos($word, $search['freeword']) === false) {
                continue;
            }
        }
        // 格納
        $tgtData[$tgtId] = $val;
    }

    // ページャー
    $dispData = getPager($tgtData, $page, 20);

    /* ===================================================
     * 例外処理
     * ===================================================
     */
} catch (Exception $e) {
    debug($e);
    exit;

    $_SESSION['err'] = !empty($err) ? $err : array();
    header("Location:" . ERROR_PAGE);
    exit;
}
