<?php
$services = array(
    "医療保険訪問看護" => array(
        "訪問看護医療保険"
    ),
    "看護小規模多機能" => array(
        "看多機　訪問介護",
        "看多機　訪問看護",
        "看多機　通い",
        "看多機　宿泊"
    ),
    "指定訪問看護" => array(
        "訪問看護　介護保険"
    ),
    "定期巡回" => array(
        "訪問看護　定期巡回"
    ),
    "医療保険訪問看護+看護小規模多機能" => array(
        "訪問看護　医療保険",
        "看多機　訪問介護",
        "看多機　訪問看護",
        "看多機　通い",
        "看多機　宿泊"
    ),
    "医療保険訪問看護+指定訪問看護" => array(
        "訪問看護　医療保険",
        "訪問看護　介護保険"
    ),
    "医療保険訪問看護+定期巡回" => array(
        "訪問看護　医療保険",
        "訪問看護　定期巡回"
    ),
    "医療訪看・指定訪看・看多機" => array(
        "訪問看護　医療保険",
        "訪問看護　介護保険",
        "看多機　訪問介護",
        "看多機　訪問看護",
        "看多機　通い",
        "看多機　宿泊"
    ),
    "指定訪看・看多機" => array(
        "訪問看護　介護保険",
        "看多機　訪問介護",
        "看多機　訪問看護",
        "看多機　通い",
        "看多機　宿泊"
    )
);
